### 데이터 프레임
-  2차원 배열
-  2차원 벡터, 행렬
-  열 == 속성 == 항목
-  행 == 레코드 == 줄
-  예) 주식종목 행 - 관측값, 열 - 종목코드, 회사이름, 액면가, 총주식수

In [17]:
# 데이터 프레임 만들기
# 방법1) 딕셔너리를 가지고 데이터프레임 만들기 
import pandas as pd
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12],'c4':[13,14,15] }
df = pd.DataFrame( dict_data, index=[ 'A', 'B', 'C' ]  ) #만들고
df.columns = ['초1','초2','초3','초4','초5'] #이름 바꾸기
print( df )

   초1  초2  초3  초4  초5
A   1   4   7  10  13
B   2   5   8  11  14
C   3   6   9  12  15

In [18]:
data = { 'name': ['Kim', 'Lee', 'Park'], 'age': [24, 27, 34], 'children': [2, 1, 3] } 
df = pd.DataFrame( data )
print( df )

   name  age  children
0   Kim   24         2
1   Lee   27         1
2  Park   34         3

In [33]:
# 방법2) pd.DataFrame(  2차원배열, index=행인덱스배열, columns = 열이름 배열 )
d_2 = [ [15,'남','덕영중'], [17, '여','수리중']  ]  #2차원
df2 = pd.DataFrame(  d_2 )
df2.index = [ '1반','2반' ]
df2.columns = ['나이','성별','중학교명']
print( df2 ) 
# 반의 이름?
print( df2.index ) 
# 학생의 자료 항목은?
print( df2.columns ) 
# rename 
# '1반'을 '준서'로  '2반'을 '예은'으로 rename 하세요
# '중학교명'을 '학교'을 rename하세요
df2 = df2.rename( index = {'1반':'준서', '2반':'예은' } , columns = { '중학교명':'학교' })
print( df2 )
# drop 삭제하기 
# 문제 '예은' 
df2_drop = df2.drop( '예은', axis=0 ) 
print( df2_drop )
# 문제 '나이'
df2_age_drop = df2.drop('나이',axis=1 )
print( df2_age_drop )

    나이 성별 중학교명
1반  15  남  덕영중
2반  17  여  수리중
Index(['1반', '2반'], dtype='object')
Index(['나이', '성별', '중학교명'], dtype='object')
    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중
    나이 성별   학교
준서  15  남  덕영중
   성별   학교
준서  남  덕영중
예은  여  수리중

In [57]:
# 교재 1-7 22페이지
exam_data = {'수학':[90,80,70], '영어':[98,89,95],'음악':[85,95,100], '체육':[100,90,90] }
df = pd.DataFrame( exam_data, index=['준서','우현','인아'] )
print(df)

df2 = df.copy()
df2 = df2.drop('우현' )
print(df2)

df3 = df.copy()
df3 = df3.drop( [ '준서', '인아' ] )
print( df3 )

df4 = df.copy()
# df4 = df4.drop(  [ '준서':'우현' ] ) 오류 발생
print( df4 )  

df5 = df.copy()
df5 = df5.drop( '영어', axis="columns" )
df5

    수학  영어   음악   체육
준서  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
    수학  영어   음악   체육
준서  90  98   85  100
인아  70  95  100   90
    수학  영어  음악  체육
우현  80  89  95  90
    수학  영어   음악   체육
준서  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

    수학   음악   체육
준서  90   85  100
우현  80   95   90
인아  70  100   90

In [90]:
# 행선택
# 열선택
# 1-9
exam_data = {'수학':[90,80,70], '영어':[98,89,95],'음악':[85,95,100], '체육':[100,90,90] }
df = pd.DataFrame( exam_data, index=['서준','우현','인아'] )
print(  df.loc[ '서준': '인아' ] )
print( df.iloc[ 0:3] )

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [92]:
# 예제 1-10 열선택
exam_data = {'이름': ['서준','우현','인아' ], 
             '수학': [90,80,70],
             '영어': [98,89,95],
             '음악': [85,95,100],
             '체육': [100,90,90] }
df = pd.DataFrame( exam_data )
df
print( type(df) )

<class 'pandas.core.frame.DataFrame'>

In [96]:
math1 = df['수학']
print( type( math1 )  )
print( math1 ) 
english = df.영어 # 많이 사용
english
a = df['체육']
a = df.체육

<class 'pandas.core.series.Series'>
0    90
1    80
2    70
Name: 수학, dtype: int64

0    98
1    89
2    95
Name: 영어, dtype: int64

In [100]:
music_gym = df[ ['음악','체육'] ]
music_gym
math = df[ ['수학'] ] # 데이터프레임 추출 
print( type(math) , "~~" ) 
math = df[ '수학' ] #시리즈 추출
print( type(math), '@@@'  )

<class 'pandas.core.frame.DataFrame'> ~~
<class 'pandas.core.series.Series'> @@@

In [78]:
math2 = df[['수학']]
print(math2)
print( type(math2) )

   수학
0  90
1  80
2  70
<class 'pandas.core.frame.DataFrame'>

In [103]:
df.iloc[::2]

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
2  인아  70  95  100   90

In [81]:
df.iloc[0:3:2]

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
2  인아  70  95  100   90

In [82]:
df.iloc[::-1]

   이름  수학  영어   음악   체육
2  인아  70  95  100   90
1  우현  80  89   95   90
0  서준  90  98   85  100

In [118]:
#예제 1-11
exam_data = {'이름': ['서준','우현','인아' ], 
             '수학': [90,80,70],
             '영어': [98,89,95],
             '음악': [85,95,100],
             '체육': [100,90,90] }
df = pd.DataFrame( exam_data )
df = df.set_index('이름') 
df.loc[ ['서준', '우현'], ['음악', '체육']  ]
#df.iloc[ 0, [2,3]  ]

    음악   체육
이름
서준  85  100
우현  95   90

In [119]:
#추가
#열추가
df['국어'] = 80
df
df['컴퓨터'] = [100,85,75]
df

    수학  영어   음악   체육  국어  컴퓨터
이름
서준  90  98   85  100  80  100
우현  80  89   95   90  80   85
인아  70  95  100   90  80   75

In [120]:
#행추가
df.loc['길동'] = [100,80,90,75,60,90 ]
df

     수학  영어   음악   체육  국어  컴퓨터
이름
서준   90  98   85  100  80  100
우현   80  89   95   90  80   85
인아   70  95  100   90  80   75
길동  100  80   90   75  60   90

In [121]:
# 41페이지 그림 1-14보고 코드해 보기 
# 예제 1-13

In [129]:
# 원소값 변경
#서준 체육 95 변경
df.loc['서준','체육'] = 95
df
#우현 국어 100변경
df.loc['우현','국어'] = 100
df
#우현 수학, 컴퓨터을 각각 100 90 변경
df.loc['우현', ['수학','컴퓨터'] ] = 100, 90
df

     수학  영어   음악  체육   국어  컴퓨터
이름
서준   90  98   85  95   80  100
우현  100  89   95  90  100   90
인아   70  95  100  90   80   75
길동  100  80   90  75   60   90

In [135]:
# 46page
# 행, 열 위치 바꾸기
df_trans = df.transpose()
df_trans
df

     수학  영어   음악  체육   국어  컴퓨터
이름
서준   90  98   85  95   80  100
우현  100  89   95  90  100   90
인아   70  95  100  90   80   75
길동  100  80   90  75   60   90